{"id":"7bdc7c8e-f571-4493-9a99-fef22d4f57b5","deck_id":"6bde56dc-563f-4481-97f3-00b65fde224f","format":"emerald","name":"Lion Swarm Kotei?","primary_clan":"lion","secondary_clan":"unicorn","description":"Original description: HI everyone! This is the deck I made the final in silver cup. I did alot of mistake at my last match in the silver by beeing unfocus cause of early morning due game.\n\n1st The famous feeding combo with Yatakabune Port : - Take favor, have censure and play feeding without problem. \n\n-Aim for 4x 2coster dude if you can do the feeding I mean don't be shy.\n\n-If you mulligan all 4 cards at start to get feeding and you didn't find one then, you rather play a 3 coster 1st turn and pass for fate. \n\n-Bid 5\n\n-Brawler to bow on the attack with water etc. Or mastermind to manage to comeback with even the odds and make a precious bow. \n\n-Assassination to avoid early break with small resources from opponent.\n\n-Go for void 100% of the time, Earth or Fire in case of a Mitsu then go for fate on ring if needed, Water if it's the way.\n\n- Always manage to do a defense cause Feeding is also double edge and can be very punishing.\n\n*Interesting and key cards*\n\n'Stone Breaker', mainly that card is there to be able to break on politics wich grant a -2 Province strength. \n\n-Other plays is moving a cancer (after u use the reducing province strength) to the province you're about to break)\n\n-Be careful on what you're moving to province because the flip is where the holding is initialy.\n\n'Ancestral Armory', very useful to get back any of the 3 weapons (Fine Katana, Scarlet saber, Elegant tessen)\n\n* Interesting play you can play Prepare For War to destroy the Elegant Tessen and to take it back with Armory then make more resources on your attack or do a better defense or 2nd conflict for example.\n\n-Honorable Challenger with all the weapon I use his duel very often and with Battle Aspirant you can even grant it betterly. Remember that he is a straighten by it'self so you can win on military with more effective then use stronghold while he is honored with pride to have more stats with his duel and for defense.\n\n-Take Up Command is amazing in terms of managing an army or even a surprise. You can use easierly your turn with that card. \n-A great play with it is to do even the odds then straighten + the honoring.\n\nNB: The deck is pretty much forward, but don't forget the possible straightens a turn! Take conscious on how you're gonna manage your resources cause there might be more to grant during a conflict or outside for defending.\n\nSometimes you rather keep a captive audience to use stone breaker to be able to break than using your captive audience too fast (as for example).\n\n**What could be change** \n\n1) A Perfect Cut you could manage to add an adorned barcha (heavy on the cost though) and a 3rd disarm or 3rd makeshift warcamp. \n\n-Be aware that free resources are good and easier to manage.\n\n2) The adding of Fan of Command in a more midrange that's what I would do. But yet it seems okish without it.\n\n3) Dynasty wise I got no problem for now everything seems to be great that way!\n\n4) I think courteous greetings would be better even if I surprise with my night raid oldschool but you know what's that doing with open deck list ^^\n\nSo I bet you get alot of fun with the deck\n\nAkodoT1 'The lion Bluffer'","version_number":"0.9","cards":{"banzai":3,"disarm":2,"censure":3,"night-raid":1,"fine-katana":3,"matsu-gohei":3,"matsu-sakura":3,"a-perfect-cut":2,"akodo-zentaro":1,"assassination":2,"even-the-odds":3,"ikoma-tsanuri":3,"scarlet-sabre":3,"seeker-of-air":1,"spoils-of-war":1,"stone-breaker":3,"elegant-tessen":3,"the-art-of-war":1,"a-season-of-war":2,"battle-aspirant":3,"feeding-an-army":3,"fortune-s-field":1,"prepare-for-war":2,"take-up-command":3,"yatakabune-port":1,"akodo-mastermind":3,"ancestral-armory":3,"captive-audience":3,"gifted-tactician":3,"hayaken-no-shiro":1,"honored-veterans":3,"meticulous-scout":3,"before-the-throne":1,"makeshift-war-camp":2,"tactical-ingenuity":3,"ikoma-master-hunter":3,"honorable-challenger":3,"lion-s-pride-brawler":3,"samurai-of-integrity":3},"published_date":null,"created_at":"2023-06-01T08:18:24.912Z","user_id":"auth0|61ec7c53214a1d006a023ef1","username":"Claesebaas"}