{"id":"3b48d4ae-ed4a-4d5f-96d7-cb8bd9c69472","deck_id":"977e1847-32f0-4183-a4a7-579da234f5c8","format":"emerald","name":"Shingeki no Kyojin: The Final Season. Walls Unbreakable","primary_clan":"crab","secondary_clan":"scorpion","description":"So here is the Kaui Wall Deck that pretty much everyone has seen me play by now. It uses both abilities of the previously unused Midnight Builder along with Floating Fortress and a complete toolbox of defensive holding effects to make provinces near-unbreakable and has enough power through Labs and Hida Guardian to punch through provinces after the opponent attack fails.\n\nVoid Role is amazing for Crab (I don't know why people don't take it more often). In addition to obvious uses like a ready on 0 fated characters and ability refresh on Hida Guardian, etc. Shadowstep allows for the reuse of our on-play abilities;\n\nProprietor - Second search for a 1 cost\nEnvoy - Turns Shadow Step into a hand recycle\nEngineer - Another rebuild\nHerald of Jade - More token removal/honour gain\n\nThe dynasty deck takes advantage of the otherwise unused Midnight Builder to turn those 17 holdings into a defensive toolbox giving d/h tokens, hand destruction, card draw and ring effects on defence in addition to +2 strength on any holding that is attacked whilst Hida Guardian/Kuni Labs can be used to push through opponent provinces.\n\nAlot of 1 cost characters along with Onryo and Proprietor makes the deck fairly swarmy so fate is rarely an issue. Remember you need to save it for your FF pops so generally go 2-cost with 2 fate, 0 fate on anything that isnt a guardian and Midnight Builder depending on board state; It's dire effect is mostly forgotten but its very strong when you need to build a defence with FF, draw heavily, or strip cards through River.","version_number":"0.11","cards":{"banzai":2,"censure":2,"reprieve":3,"kaiu-envoy":3,"pilgrimage":1,"court-games":3,"kaiu-forges":1,"kyuden-hida":1,"shadow-step":3,"third-tower":1,"fire-and-oil":2,"funeral-pyre":2,"assassination":2,"hida-guardian":3,"seventh-tower":1,"shrewd-yasuki":3,"ceaseless-duty":3,"elegant-tessen":3,"fertile-fields":1,"herald-of-jade":3,"seeker-of-void":1,"weight-of-duty":1,"kuni-laboratory":3,"way-of-the-crab":3,"midnight-builder":3,"no-breath-wasted":3,"calling-in-favors":3,"cinder-salamander":3,"floating-fortress":3,"recalled-defenses":3,"bloodthirsty-onryo":2,"courteous-greeting":1,"pathfinder-s-blade":3,"to-govern-the-land":3,"apprentice-engineer":3,"ashen-flame-plateau":1,"student-of-anatomies":3,"gallant-quartermaster":3,"hot-springs-proprietor":2,"restorative-hot-spring":1,"river-of-the-last-stand":1,"borderlands-fortifications":2},"published_date":"2023-06-24T17:04:57.134Z","created_at":"2023-06-15T10:03:08.269Z","user_id":"auth0|60f281ff7a2fb20070978491","username":"JeremiahBlitz"}